LCS_Testcases/LCS_Testcase_cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         150;

deltaT          0.001;

writeControl    runTime;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       0.1;

// ************************************************************************* //

functions
{
	lagrangianCoherentStructures
    {
        type            LCS;
        // Where to load it from (if not already in solver)
        functionObjectLibs ("libLCSFunctionObject.so");

        // Specifies if the main mesh is a static rectlinear Mesh 
        // (if yes the main cfd mesh is also used for the lcs computations)
        // (if not a rectlinear LCS blockMesh has to be created under constant/LCS/polyMesh beforehand)  
        isStaticRectLinear false;

        // Numer of cells in mesh in x, y and z direction (must correspond with used mesh)
        n (400 320 1);

        // Velocity field name
        velocityName "U";

        // Start time of LCS diagnostic - (default: startTime of simulation)
        lcsStartTime 50;

        // End time of LCS diagnostic - (default: endTime of simulation)
        lcsEndTime 150;

        // LCS output interval in s
        lcsWriteTimeIntervall 5;

        // Switches for FTLE field evaluation 
        // - Forward time (repelling) FTLE field - (default: true/on)
        ftleFwd    on;
        // - Backward time (attracting) FTLE field - (default: false/off)
        ftleBkwd   on;

        // Specifies addition or removal of grid points for the diagnostic calculation
        // - 0 LCS diagnostic will be computed on same grid (is default)
        // - 1, 2, ... Diagnostic will be computed on a grid with resolution times more grid points
        // - -1, -2, ... Diagnostic will be computed on a grid with resolution times less grid points
        resolution 0;

        lcsCFL          0.5;

        integrator      rk3;

        interpolator    linear;
        

        // LCS Options
        lcsOptions
        {
            synctimer       off;
            debug           off;
            writeFlowmap    on;
            writeBCFlags    on;
            incompressible  on;
            auxGrid         off;
        }
};
